app/views/articles/new.html.erb

                  <button class="btn btn-primary dropdown-toggle" type="button" data-toggle="dropdown" aria-haspopup="true" aria-expanded="false">Categories</button>
                  <%= f.collection_select(:category_id, Category.all, :id, :name, {}, {:class=>'dropdown-menu'})%>
---
SELECT  "categories".* FROM "categories" ORDER BY "categories"."id" ASC LIMIT $1  [["LIMIT", 1]]