app/views/users/_articles_carousel.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
              <li data-target="#articles-carousel" data-slide-to="<%= @articles.index(article) %>" class='fa fa-rocket'></li>
              <li> <a href="<%= User.find(article.author_id)%>" class='btn btn-warning'>Written by: <%= User.find(article.author_id).full_name %> </a> </li>