app/views/users/_user_navbar.html.erb

                    <li><%= link_to 'Logout', :logout, class: 'green-text'%></li>
                    <li><%= link_to 'Profile', User.find(session[:user_id]), class: 'yellow-text'%></li>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]