app/views/home/_articles.html.erb


                  <img src="<%= @articles.first.image_link%>" class='article-img'>
---
SELECT  "articles".* FROM "articles" ORDER BY "articles"."id" ASC LIMIT $1  [["LIMIT", 1]]