app/views/home/_learn_center.html.erb


      <% if @category.articles.empty? %>
---
SELECT  1 AS one FROM "articles" WHERE "articles"."category_id" = $1 LIMIT $2  [["category_id", 4], ["LIMIT", 1]]
SELECT "articles".* FROM "articles" WHERE "articles"."category_id" = $1  [["category_id", 1]]