app/views/home/_navbar.html.erb

                <li><%= link_to 'Logout', :logout, class: 'green-text'%></li>
                <li><%= link_to 'Profile', User.find(session[:user_id]), class: 'yellow-text'%></li>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]