app/views/app_email_mailer/email.html.erb

  <body>
    <h1>Hi <%= User.first.first_name %></h1>
---
SELECT  "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]