app/controllers/articles_controller.rb

SELECT  "categories".* FROM "categories" WHERE "categories"."name" = $1 LIMIT $2  [["name", "Test"], ["LIMIT", 1]]
---
  def create
    obj = Article.nokogiri_obj_makr(params[:article][:link])
    title = Article.title_grabber(obj)
    img = Article.img_grabber(obj)
    categ = Category.find_by_name(params[:article][:category]).id