app/controllers/articles_controller.rb

SELECT  "categories".* FROM "categories" ORDER BY "categories"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
  def new
    @article = Article.new()
    @categories = Category.first

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "articles" ("link", "title", "author_id", "image_link", "category_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    obj = Article.nokogiri_obj_makr(params[:article][:link])
    title = Article.title_grabber(obj)
    img = Article.img_grabber(obj)
    categ = Category.find(params[:article][:category_id])

    @article  = Article.new(title: title, body: params[:body], category_id: categ.id, image_link: img, author_id: session[:user_id], link: params[:article][:link])

    if @article.save