app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories" WHERE (name ILIKE '%Tes%') ORDER BY created_at DESC
---
  def index
    @categories = Category.all