app/controllers/friendships_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
INSERT INTO "friendships" ("user_id", "friend_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 6], ["friend_id", 6], ["created_at", 2017-02-28 01:00:35 UTC], ["updated_at", 2017-02-28 01:00:35 UTC]]
---
    def create
      user = User.find(session[:user_id])
      friend = User.find(params[:user_id])

      p '#################################'

      friendship = Friendship.new(user_id: user.id, friend_id: friend.id)

      if friendship.save