app/controllers/home_controller.rb

  def index
    @user = User.new
    @articles = Article.all
    @category = nil

    if params[:search]
      @category = Category.find_by_name(params[:search][:name])
      params[:search] = nil
    else
      @category = Category.all.order("created_at DESC")
---
SELECT  "articles".* FROM "articles" ORDER BY "articles"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT  "categories".* FROM "categories" WHERE "categories"."name" = $1 LIMIT $2  [["name", "test"], ["LIMIT", 1]]
SELECT  "categories".* FROM "categories" ORDER BY created_at DESC LIMIT $1  [["LIMIT", 1]]