app/controllers/sessions_controller.rb

  def create
    p '************************************************'
    user = User.find_by_email(params[:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "c@c.com"], ["LIMIT", 1]]