app/controllers/users_controller.rb

  def create
    @user  = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("first_name", "last_name", "email", "password_digest", "address", "zip_code", "city", "state", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

  def update
    user = User.find(params[:id])

    if user
      user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "users" SET "first_name" = $1, "last_name" = $2, "address" = $3, "zip_code" = $4, "city" = $5, "state" = $6, "updated_at" = $7 WHERE "users"."id" = $8  [["first_name", "Haley"], ["last_name", "Dean"], ["address", "1252 WestBrook ave,"], ["zip_code", 94707], ["city", "Sacramento"], ["state", "Ca"], ["updated_at", 2017-02-21 22:19:39 UTC], ["id", 6]]